
  <details>
  <summary>terraform/backends - Terraform Plan Output (click to expand)</summary>
  
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # postgresql_database.mgmt_db will be created
  + resource "postgresql_database" "mgmt_db" {
      + allow_connections = true
      + connection_limit  = -1
      + encoding          = (known after apply)
      + id                = (known after apply)
      + is_template       = (known after apply)
      + lc_collate        = (known after apply)
      + lc_ctype          = (known after apply)
      + name              = "mgmt"
      + owner             = (known after apply)
      + tablespace_name   = (known after apply)
      + template          = (known after apply)
    }

  # postgresql_grant.mgmt_grant will be created
  + resource "postgresql_grant" "mgmt_grant" {
      + database          = "mgmt"
      + id                = (known after apply)
      + object_type       = "database"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "mgmt"
      + with_grant_option = false
    }

  # postgresql_role.mgmt_role will be created
  + resource "postgresql_role" "mgmt_role" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = true
      + name                      = "mgmt"
      + password                  = (sensitive value)
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
